### Pandas Lab - Finding, Querying, Creating Data

### Section 1: Selecting Data

Complete the following prompts, and compare your results with the answers to confirm that you did the operation properly.

In [2]:
# load the data first - adjust to get the correct file path
import pandas as pd
import numpy as np
df = pd.read_csv('../../data/titanic.csv')

**1).** Find the average age of all passengers on board.  The answer will be 29.7

In [6]:
# Your Code Here
df['Age'].mean()

29.69911764705882

**2).** Find the median value of the 'Fare' and 'SibSp' columns.  The answer will be 14.45 and 0.00, respectively.

In [7]:
# Your Code Here
df[['Fare', 'SibSp']].median()

Fare     14.4542
SibSp     0.0000
dtype: float64

**3).** Find the median value of *the first 100 rows* of Fare and SibSp columns.  The answer will be 15.675 and 0.00.

In [8]:
# Your Code Here
df[['Fare', 'SibSp']][:100].median()

Fare     15.675
SibSp     0.000
dtype: float64

**4).** Using the .iloc command, grab the modal value of the last 4 columns in the dataset.  The result should be a 3x3 dataframe that has the values 1601, 8.05, B96 B98, and S in the first row.

In [9]:
# Your Code Here
df.iloc[:, -4:].mode()

     Ticket  Fare        Cabin Embarked
0      1601  8.05      B96 B98        S
1    347082   NaN  C23 C25 C27      NaN
2  CA. 2343   NaN           G6      NaN

**5).** Using the .iloc command, grab the mean value of the first 250 rows of the first 3 columns in the dataset.  The answer should be:
    - Passengerid: 125.5
    - Survived: 0.344
    - Pclass: 2.416

In [10]:
# Your Code Here
df.iloc[:250, :3].mean()

PassengerId    125.500
Survived         0.344
Pclass           2.416
dtype: float64

### Section 2: Querying Data

**1).** How many females were on board the Titanic? Men? The answers should be 314, 577

In [11]:
# Your Code Here
num_females = df[df.Sex == 'female'].shape[0]
num_males   = df[df.Sex == 'male'].shape[0]
print("# of females", num_females)
print("# of males", num_males)

# of females 314
# of males 577

**2).** What was the survival rate for females on the Titanic? The answer should be 0.74

In [13]:
# Your Code Here
df[df.Sex == 'female']['Survived'].mean()

0.7420382165605095

**3).** What was the survival rate for Males? The answer should be 0.19

In [14]:
# Your Code Here
df[df.Sex == 'male']['Survived'].mean()

0.18890814558058924

**4).** What was the survival rate for passengers in either Pclass 1 or Pclass 2?  The answer should be 0.5575

In [15]:
# Your Code Here
df[(df.Pclass == 1) | (df.Pclass == 2)]['Survived'].mean()

0.5575

**5).** What was the survival rate if you were female and had at least 1 sibling on board? The answer should be 0.686.

In [16]:
# Your Code Here
df[(df.Sex == 'female') & (df.SibSp >= 1)]['Survived'].mean()

0.6857142857142857

### Section 3: Creating New Data

**1).** Create a column called 'Is_Alone' that's either True or False, depending on whether or not the column 'Family_Size' is > 0 or not.

In [19]:
# Your Code Here
df['Family_Size'] = df.Parch + df.SibSp
df['Is_Alone']    = np.where(df.Family_Size < 1, True, False)

**2).** Create a column called 'Demographic' that breaks people up into the following categories:
 - Below 8 years old: 'Child'
 - 8 - 21 years old: 'Adolescent'
 - 22 - 55 years old: 'Adult'
 - 55+: 'Senior'

In [4]:
# Your Code Here
df['Demographic'] = pd.cut(df['Age'], bins=[df['Age'].min(), 7, 21, 55, df['Age'].max()], labels=['Child', 'Adolescent', 'Adult', 'Senior'])

In [5]:
df['Demographic'].value_counts()

Adult         470
Adolescent    154
Child          49
Senior         40
Name: Demographic, dtype: int64

In [9]:
df.loc[df.Demographic == 'Child',['Age','Demographic']]

      Age Demographic
7    2.00       Child
10   4.00       Child
16   2.00       Child
43   3.00       Child
50   7.00       Child
58   5.00       Child
63   4.00       Child
78   0.83       Child
119  2.00       Child
164  1.00       Child
171  4.00       Child
172  1.00       Child
183  1.00       Child
184  4.00       Child
193  3.00       Child
205  2.00       Child
233  5.00       Child
261  3.00       Child
278  7.00       Child
297  2.00       Child
305  0.92       Child
340  2.00       Child
348  3.00       Child
374  3.00       Child
381  1.00       Child
386  1.00       Child
407  3.00       Child
445  4.00       Child
448  5.00       Child
469  0.75       Child
479  2.00       Child
530  2.00       Child
535  7.00       Child
618  4.00       Child
642  2.00       Child
644  0.75       Child
691  4.00       Child
720  6.00       Child
750  4.00       Child
751  6.00       Child
755  0.67       Child
777  5.00       Child
788  1.00       Child
813  6.00       Child
824  2.00       Child
827  1.00       Child
831  0.83       Child
850  4.00       Child
869  4.00       Child

In [16]:
df.iloc[803,:]

PassengerId                                804
Survived                                     1
Pclass                                       3
Name           Thomas, Master. Assad Alexander
Sex                                       male
Age                                       0.42
SibSp                                        0
Parch                                        1
Ticket                                    2625
Fare                                    8.5167
Cabin                                      NaN
Embarked                                     C
Demographic                                NaN
Name: 803, dtype: object

**3).** Create a column called 'Gender_Status' that returns the following values:

 - 'F-High' if passenger is female and passenger class is 1.
 - 'F-Low' if passenger is female and passenger class is 2 or 3
 - 'M-High' if passenger is male and passenger class is 1
 - 'M-Low' if passenger is male and passenger class is 2 or 3

In [38]:
# Your Code Here
conditions = [
    (df.Sex == 'female') & (df.Pclass == 1),
    (df.Sex == 'female') & ((df.Pclass == 2) | (df.Pclass == 3)),
    (df.Sex == 'male') & (df.Pclass == 1),
    (df.Sex == 'male') & ((df.Pclass == 2) | (df.Pclass == 3))
]

results = [
    'F-High',
    'F-Low',
    'M-High',
    'M-Low'
]

df['Gender_Status'] = np.select(conditions, results, 'Other')

In [39]:
df['Gender_Status'].value_counts()

M-Low     455
F-Low     220
M-High    122
F-High     94
Name: Gender_Status, dtype: int64

**4).** Using string methods, extract the *greeting* of the persons name on board.  Ie, if someone's name is 'Ms. Madame Bovary', create a column that contains the value 'Ms.' and nothing else.

In [45]:
# Your Code Here
df['Greeting'] = df['Name'].str.split().str[1]

In [46]:
df['Greeting'].head()

0      Mr.
1     Mrs.
2    Miss.
3     Mrs.
4      Mr.
Name: Greeting, dtype: object